Repository: DanilaAnikin/classio
Catalog: lib/core/localization/l10n/app_*.arb
Languages: cs

# welcomeMessage
source: Welcome to Classio
cs: Vitejte v Classio

source: Settings
cs: Nastaveni

source: Language
cs: Jazyk

source: Theme
cs: Motiv

# cleanTheme
source: Clean
cs: Cisty

# playfulTheme
source: Playful
cs: Hravy

source: Home
cs: Domov

source: Dashboard
cs: Prehled

source: Select Language
cs: Vyberte jazyk

source: Select Theme
cs: Vyberte motiv

source: Save
cs: Ulozit

source: Cancel
cs: Zrusit

source: Login
cs: Prihlasit se

source: Logout
cs: Odhlasit se

source: Password
cs: Heslo

source: Welcome Back
cs: Vitejte zpet

source: Sign in to continue
cs: Prihlaste se pro pokracovani

source: Forgot Password?
cs: Zapomneli jste heslo?

# loginError
source: Login failed. Please check your credentials.
cs: Prihlaseni selhalo. Zkontrolujte prosim sve udaje.

# emailRequired
source: Email is required
cs: E-mail je povinny

# emailInvalid
source: Please enter a valid email
cs: Zadejte prosim platny e-mail

# passwordRequired
source: Password is required
cs: Heslo je povinne

# passwordTooShort
source: Password must be at least 6 characters
cs: Heslo musi mit alespon 6 znaku

source: Logging in...
cs: Prihlasuji se...

# dashboardGreetingMorning
source: Good Morning
cs: Dobre rano

# dashboardGreetingAfternoon
source: Good Afternoon
cs: Dobre odpoledne

# dashboardGreetingEvening
source: Good Evening
cs: Dobry vecer

# dashboardUpNext
source: Up Next
cs: Nasleduje

# dashboardTodaySchedule
source: Today's Schedule
cs: Dnesni rozvrh

# dashboardDueSoon
source: Due Soon
cs: Blizi se termin

# lessonCancelled
source: Cancelled
cs: Zruseno

# lessonSubstitution
source: Substitution
cs: Suplovani

# lessonInProgress
source: In Progress
cs: Probiha

# lessonUpcoming
source: Starting in {minutes} min
cs: Zacina za {minutes} min

# lessonRoom
source: Room {room}
cs: Ucebna {room}

# assignmentDueToday
source: Due Today
cs: Odevzdat dnes

# assignmentDueTomorrow
source: Due Tomorrow
cs: Odevzdat zitra

# assignmentDueIn
source: Due in {days} days
cs: Odevzdat za {days} dni

# assignmentCompleted
source: Completed
cs: Dokonceno

# assignmentOverdue
source: Overdue
cs: Po terminu

source: No lessons today
cs: Dnes zadne hodiny

source: No upcoming assignments
cs: Zadne blizici se ukoly

source: All done for today!
cs: Na dnes vse hotovo!

source: Free Time
cs: Volno

# dashboardLoading
source: Loading your dashboard...
cs: Nacitam nastenku...

# dashboardError
source: Something went wrong
cs: Neco se pokazilo

# dashboardRetry
source: Retry
cs: Zkusit znovu

# navHome
source: Home
cs: Domu

# navSchedule
source: Schedule
cs: Rozvrh

# navGrades
source: Grades
cs: Znamky

# navProfile
source: Profile
cs: Profil

# scheduleTitle
source: Weekly Schedule
cs: Tydenni rozvrh

# scheduleMonday
source: Mon
cs: Po

# scheduleTuesday
source: Tue
cs: Ut

# scheduleWednesday
source: Wed
cs: St

# scheduleThursday
source: Thu
cs: Ct

# scheduleFriday
source: Fri
cs: Pa

# scheduleSaturday
source: Sat
cs: So

# scheduleSunday
source: Sun
cs: Ne

# scheduleMondayFull
source: Monday
cs: Pondeli

# scheduleTuesdayFull
source: Tuesday
cs: Utery

# scheduleWednesdayFull
source: Wednesday
cs: Streda

# scheduleThursdayFull
source: Thursday
cs: Ctvrtek

# scheduleFridayFull
source: Friday
cs: Patek

# scheduleNoLessons
source: No lessons scheduled
cs: Zadne hodiny

# scheduleBreak
source: Break
cs: Prestavka

# gradesTitle
source: Grades
cs: Znamky

source: Grades coming soon
cs: Znamky jiz brzy

# profileTitle
source: Profile
cs: Profil

# profileThemeSection
source: Appearance
cs: Vzhled

# profileLanguageSection
source: Language
cs: Jazyk

# profileLogout
source: Log out
cs: Odhlasit se

# profileLogoutConfirm
source: Are you sure you want to log out?
cs: Opravdu se chcete odhlasit?

# gradesAverage
source: Average
cs: Prumer

# gradesWeight
source: Weight
cs: Vaha

# gradesDate
source: Date
cs: Datum

# gradesOverallAverage
source: Overall Average
cs: Celkovy prumer

# gradesNoGrades
source: No grades yet
cs: Zatim zadne znamky

# gradesWeightFormat
source: Weight {weight}
cs: Vaha {weight}

# subjectDetailStream
source: Stream
cs: Příspěvky

# subjectDetailStreamDescription
source: Class announcements and updates
cs: Oznámení a aktuality z hodiny

# subjectDetailAssignments
source: Assignments
cs: Úkoly

# subjectDetailAssignmentsDescription
source: Your tasks and homework
cs: Vaše úkoly a domácí práce

# subjectDetailMaterials
source: Materials
cs: Materiály

# subjectDetailMaterialsDescription
source: Course resources and files
cs: Materiály a soubory kurzu

# subjectDetailAnnouncement
source: Announcement
cs: Oznámení

# subjectDetailAssignment
source: Assignment
cs: Úkol

# subjectDetailSubmit
source: Submit
cs: Odevzdat

# subjectDetailSubmitted
source: Assignment Submitted!
cs: Úkol odevzdán!

# subjectDetailNoStream
source: No announcements yet
cs: Zatím žádná oznámení

# subjectDetailNoAssignments
source: No assignments yet
cs: Zatím žádné úkoly

# subjectDetailNoMaterials
source: No materials yet
cs: Zatím žádné materiály

# subjectDetailDueDate
source: Due {date}
cs: Termín {date}

# subjectDetailPostedBy
source: Posted by {author}
cs: Přidal/a {author}

# subjectDetailViewMaterial
source: View Material
cs: Zobrazit materiál

# dashboardInProgress
source: In Progress
cs: Probíhá

# dashboardUpNextLabel
source: Up Next
cs: Další

# dashboardStarted
source: Started
cs: Začalo

# dashboardStartingNow
source: Starting now
cs: Začíná nyní

# dashboardInHoursMinutes
source: in {hours}h {minutes}m
cs: za {hours}h {minutes}m

# dashboardInMinutes
source: in {minutes}m
cs: za {minutes}m

# dashboardCancelled
source: Cancelled
cs: Zrušeno

# dashboardSubstitution
source: Substitution: {teacher}
cs: Suplování: {teacher}

# dashboardAllDone
source: All done for today!
cs: Vše hotovo na dnešek!

# dashboardNoMoreLessons
source: No more lessons scheduled
cs: Žádné další hodiny naplánovány

# dashboardNoClassesToday
source: No classes today
cs: Dnes žádné hodiny

# dashboardEnjoyFreeDay
source: Enjoy your free day!
cs: Užijte si volný den!

# dashboardSub
source: SUB
cs: SUP

# dashboardToday
source: Today
cs: Dnes

# dashboardTomorrow
source: Tomorrow
cs: Zítra

# dashboardLater
source: Later
cs: Později

# dashboardAllCaughtUp
source: All caught up!
cs: Vše zvládnuto!

# dashboardNoAssignmentsDue
source: No assignments due soon
cs: Žádné úkoly brzy nesplatné

# dashboardSomethingWrong
source: Something went wrong
cs: Něco se pokazilo

# dashboardAnError
source: An error occurred
cs: Došlo k chybě

# dashboardNoData
source: No data available
cs: Žádná data k dispozici

# scheduleLessonCount
source: {count} lesson
cs: {count} hodina

# scheduleLessonsCount
source: {count} lessons
cs: {count} hodin

# scheduleWeekend
source: Weekend!
cs: Víkend!

# scheduleEnjoyTimeOff
source: Enjoy your time off!
cs: Užijte si volno!

# scheduleFreeDay
source: You have a free day. Time to relax!
cs: Máte volný den. Čas odpočívat!

# scheduleUnknown
source: Unknown
cs: Neznámý

# gradesNoGradesYet
source: No grades yet
cs: Zatím žádné známky

# gradesWillAppear
source: Your grades will appear here once they are available.
cs: Vaše známky se zde zobrazí, jakmile budou k dispozici.

# gradesFailedToLoad
source: Failed to load grades
cs: Nepodařilo se načíst známky

# gradesRetry
source: Retry
cs: Opakovat

# gradesExcellent
source: Excellent
cs: Výborně

# gradesGood
source: Good
cs: Dobře

# gradesFair
source: Fair
cs: Dostatečně

# gradesNeedsWork
source: Needs Work
cs: Potřebuje zlepšit

# gradesWeightLabel
source: Weight {weight}
cs: Váha {weight}

# subjectStream
source: Stream
cs: Aktuality

# subjectAssignments
source: Assignments
cs: Úkoly

# subjectMaterials
source: Materials
cs: Materiály

# subjectNoPostsYet
source: No posts yet
cs: Zatím žádné příspěvky

# subjectPostsWillAppear
source: Posts will appear here when your teacher shares updates
cs: Příspěvky se zde zobrazí, když učitel sdílí aktualizace

# subjectTodayAt
source: Today at {time}
cs: Dnes v {time}

# subjectYesterdayAt
source: Yesterday at {time}
cs: Včera v {time}

# subjectDayAt
source: {day} at {time}
cs: {day} v {time}

# subjectNoAssignments
source: No assignments
cs: Žádné úkoly

# subjectAssignmentsWillAppear
source: Assignments will appear here when your teacher posts them
cs: Úkoly se zde zobrazí, když je učitel zadá

# subjectDueToday
source: Due today
cs: Splatné dnes

# subjectDueTomorrow
source: Due tomorrow
cs: Splatné zítra

# subjectDueDate
source: Due {date}
cs: Splatné {date}

# subjectSubmitted
source: Assignment Submitted!
cs: Úkol odevzdán!

# subjectSubmit
source: Submit
cs: Odevzdat

# subjectNoMaterials
source: No materials
cs: Žádné materiály

# subjectMaterialsWillAppear
source: Course materials will appear here when your teacher shares them
cs: Materiály kurzu se zde zobrazí, když je učitel sdílí

# subjectOpening
source: Opening: {url}
cs: Otevírám: {url}

# subjectFailedToLoad
source: Failed to load subject
cs: Nepodařilo se načíst předmět
